Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxConverter_bf.h
/** \brief Offset for Ifx_CONVERTER_ACCEN0_Bits.EN25 */
#define IFX_CONVERTER_ACCEN0_EN25_OFF (25u)

/** \brief Length for Ifx_CONVERTER_ACCEN0_Bits.EN26 */
#define IFX_CONVERTER_ACCEN0_EN26_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_ACCEN0_Bits.EN26 */
#define IFX_CONVERTER_ACCEN0_EN26_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_ACCEN0_Bits.EN26 */
#define IFX_CONVERTER_ACCEN0_EN26_OFF (26u)

/** \brief Length for Ifx_CONVERTER_ACCEN0_Bits.EN27 */
#define IFX_CONVERTER_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_ACCEN0_Bits.EN27 */
#define IFX_CONVERTER_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_ACCEN0_Bits.EN27 */
#define IFX_CONVERTER_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_CONVERTER_ACCEN0_Bits.EN28 */
#define IFX_CONVERTER_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_ACCEN0_Bits.EN28 */
#define IFX_CONVERTER_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_ACCEN0_Bits.EN28 */
#define IFX_CONVERTER_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_CONVERTER_ACCEN0_Bits.EN29 */
#define IFX_CONVERTER_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_ACCEN0_Bits.EN29 */
#define IFX_CONVERTER_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_ACCEN0_Bits.EN29 */
#define IFX_CONVERTER_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_CONVERTER_ACCEN0_Bits.EN30 */
#define IFX_CONVERTER_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_ACCEN0_Bits.EN30 */
#define IFX_CONVERTER_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_ACCEN0_Bits.EN30 */
#define IFX_CONVERTER_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_CONVERTER_ACCEN0_Bits.EN31 */
#define IFX_CONVERTER_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_ACCEN0_Bits.EN31 */
#define IFX_CONVERTER_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_ACCEN0_Bits.EN31 */
#define IFX_CONVERTER_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_CONVERTER_CCCTRL_Bits.TC */
#define IFX_CONVERTER_CCCTRL_TC_LEN (4u)

/** \brief Mask for Ifx_CONVERTER_CCCTRL_Bits.TC */
#define IFX_CONVERTER_CCCTRL_TC_MSK (0xfu)

/** \brief Offset for Ifx_CONVERTER_CCCTRL_Bits.TC */
#define IFX_CONVERTER_CCCTRL_TC_OFF (28u)

/** \brief Length for Ifx_CONVERTER_PHSCFG_Bits.PHSDIV */
#define IFX_CONVERTER_PHSCFG_PHSDIV_LEN (4u)

/** \brief Mask for Ifx_CONVERTER_PHSCFG_Bits.PHSDIV */
#define IFX_CONVERTER_PHSCFG_PHSDIV_MSK (0xfu)

/** \brief Offset for Ifx_CONVERTER_PHSCFG_Bits.PHSDIV */
#define IFX_CONVERTER_PHSCFG_PHSDIV_OFF (0u)

/** \brief Length for Ifx_CONVERTER_PHSCFG_Bits.PDWC */
#define IFX_CONVERTER_PHSCFG_PDWC_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_PHSCFG_Bits.PDWC */
#define IFX_CONVERTER_PHSCFG_PDWC_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_PHSCFG_Bits.PDWC */
#define IFX_CONVERTER_PHSCFG_PDWC_OFF (15u)

/** \brief Length for Ifx_CONVERTER_VRCFG_Bits.BDON */
#define IFX_CONVERTER_VRCFG_BDON_LEN (2u)

/** \brief Mask for Ifx_CONVERTER_VRCFG_Bits.BDON */
#define IFX_CONVERTER_VRCFG_BDON_MSK (0x3u)

/** \brief Offset for Ifx_CONVERTER_VRCFG_Bits.BDON */
#define IFX_CONVERTER_VRCFG_BDON_OFF (0u)

/** \brief Length for Ifx_CONVERTER_VRCFG_Bits.SUPLEV */
#define IFX_CONVERTER_VRCFG_SUPLEV_LEN (2u)

/** \brief Mask for Ifx_CONVERTER_VRCFG_Bits.SUPLEV */
#define IFX_CONVERTER_VRCFG_SUPLEV_MSK (0x3u)

/** \brief Offset for Ifx_CONVERTER_VRCFG_Bits.SUPLEV */
#define IFX_CONVERTER_VRCFG_SUPLEV_OFF (2u)

/** \brief Length for Ifx_CONVERTER_VRCFG_Bits.ITRIM */
#define IFX_CONVERTER_VRCFG_ITRIM_LEN (3u)

/** \brief Mask for Ifx_CONVERTER_VRCFG_Bits.ITRIM */
#define IFX_CONVERTER_VRCFG_ITRIM_MSK (0x7u)

/** \brief Offset for Ifx_CONVERTER_VRCFG_Bits.ITRIM */
#define IFX_CONVERTER_VRCFG_ITRIM_OFF (4u)

/** \brief Length for Ifx_CONVERTER_VRCFG_Bits.BGMON */
#define IFX_CONVERTER_VRCFG_BGMON_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_VRCFG_Bits.BGMON */
#define IFX_CONVERTER_VRCFG_BGMON_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_VRCFG_Bits.BGMON */
#define IFX_CONVERTER_VRCFG_BGMON_OFF (7u)

/** \brief Length for Ifx_CONVERTER_VRCFG_Bits.IREFSEL */
#define IFX_CONVERTER_VRCFG_IREFSEL_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_VRCFG_Bits.IREFSEL */
#define IFX_CONVERTER_VRCFG_IREFSEL_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_VRCFG_Bits.IREFSEL */
#define IFX_CONVERTER_VRCFG_IREFSEL_OFF (8u)

/** \brief Length for Ifx_CONVERTER_VRCFG_Bits.VREFSEL */
#define IFX_CONVERTER_VRCFG_VREFSEL_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_VRCFG_Bits.VREFSEL */
#define IFX_CONVERTER_VRCFG_VREFSEL_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_VRCFG_Bits.VREFSEL */
#define IFX_CONVERTER_VRCFG_VREFSEL_OFF (9u)

/** \brief Length for Ifx_CONVERTER_VRCFG_Bits.VRWC */
#define IFX_CONVERTER_VRCFG_VRWC_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_VRCFG_Bits.VRWC */
#define IFX_CONVERTER_VRCFG_VRWC_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_VRCFG_Bits.VRWC */
#define IFX_CONVERTER_VRCFG_VRWC_OFF (15u)

/** \brief Length for Ifx_CONVERTER_VRSTAT_Bits.BGOK */
#define IFX_CONVERTER_VRSTAT_BGOK_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_VRSTAT_Bits.BGOK */
#define IFX_CONVERTER_VRSTAT_BGOK_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_VRSTAT_Bits.BGOK */
#define IFX_CONVERTER_VRSTAT_BGOK_OFF (0u)

/** \brief Length for Ifx_CONVERTER_PICFG_Bits.PVALUE */
#define IFX_CONVERTER_PICFG_PVALUE_LEN (8u)

/** \brief Mask for Ifx_CONVERTER_PICFG_Bits.PVALUE */
#define IFX_CONVERTER_PICFG_PVALUE_MSK (0xffu)

/** \brief Offset for Ifx_CONVERTER_PICFG_Bits.PVALUE */
#define IFX_CONVERTER_PICFG_PVALUE_OFF (0u)

/** \brief Length for Ifx_CONVERTER_PICFG_Bits.IVALUE */
#define IFX_CONVERTER_PICFG_IVALUE_LEN (8u)

/** \brief Mask for Ifx_CONVERTER_PICFG_Bits.IVALUE */
#define IFX_CONVERTER_PICFG_IVALUE_MSK (0xffu)

/** \brief Offset for Ifx_CONVERTER_PICFG_Bits.IVALUE */
#define IFX_CONVERTER_PICFG_IVALUE_OFF (16u)

/** \brief Length for Ifx_CONVERTER_SGCFGA_Bits.SWGA */
#define IFX_CONVERTER_SGCFGA_SWGA_LEN (16u)

/** \brief Mask for Ifx_CONVERTER_SGCFGA_Bits.SWGA */
#define IFX_CONVERTER_SGCFGA_SWGA_MSK (0xffffu)

