Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxConverter_bf.h
/** \brief Offset for Ifx_CONVERTER_SGCFGA_Bits.SWGA */
#define IFX_CONVERTER_SGCFGA_SWGA_OFF (16u)

/** \brief Length for Ifx_CONVERTER_SGCFGK_Bits.SWGK */
#define IFX_CONVERTER_SGCFGK_SWGK_LEN (32u)

/** \brief Mask for Ifx_CONVERTER_SGCFGK_Bits.SWGK */
#define IFX_CONVERTER_SGCFGK_SWGK_MSK (0xffffffffu)

/** \brief Offset for Ifx_CONVERTER_SGCFGK_Bits.SWGK */
#define IFX_CONVERTER_SGCFGK_SWGK_OFF (0u)

/** \brief Length for Ifx_CONVERTER_SLOPE_Bits.SLOPEVALUE */
#define IFX_CONVERTER_SLOPE_SLOPEVALUE_LEN (22u)

/** \brief Mask for Ifx_CONVERTER_SLOPE_Bits.SLOPEVALUE */
#define IFX_CONVERTER_SLOPE_SLOPEVALUE_MSK (0x3fffffu)

/** \brief Offset for Ifx_CONVERTER_SLOPE_Bits.SLOPEVALUE */
#define IFX_CONVERTER_SLOPE_SLOPEVALUE_OFF (0u)

/** \brief Length for Ifx_CONVERTER_MIN_Bits.MINVALUE */
#define IFX_CONVERTER_MIN_MINVALUE_LEN (28u)

/** \brief Mask for Ifx_CONVERTER_MIN_Bits.MINVALUE */
#define IFX_CONVERTER_MIN_MINVALUE_MSK (0xfffffffu)

/** \brief Offset for Ifx_CONVERTER_MIN_Bits.MINVALUE */
#define IFX_CONVERTER_MIN_MINVALUE_OFF (0u)

/** \brief Length for Ifx_CONVERTER_MAX_Bits.MAXVALUE */
#define IFX_CONVERTER_MAX_MAXVALUE_LEN (28u)

/** \brief Mask for Ifx_CONVERTER_MAX_Bits.MAXVALUE */
#define IFX_CONVERTER_MAX_MAXVALUE_MSK (0xfffffffu)

/** \brief Offset for Ifx_CONVERTER_MAX_Bits.MAXVALUE */
#define IFX_CONVERTER_MAX_MAXVALUE_OFF (0u)

/** \brief Length for Ifx_CONVERTER_SHIFT_Bits.SHPAT */
#define IFX_CONVERTER_SHIFT_SHPAT_LEN (32u)

/** \brief Mask for Ifx_CONVERTER_SHIFT_Bits.SHPAT */
#define IFX_CONVERTER_SHIFT_SHPAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_CONVERTER_SHIFT_Bits.SHPAT */
#define IFX_CONVERTER_SHIFT_SHPAT_OFF (0u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.SINEN */
#define IFX_CONVERTER_TESTCFG_SINEN_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.SINEN */
#define IFX_CONVERTER_TESTCFG_SINEN_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.SINEN */
#define IFX_CONVERTER_TESTCFG_SINEN_OFF (0u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.SHIFTEN */
#define IFX_CONVERTER_TESTCFG_SHIFTEN_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.SHIFTEN */
#define IFX_CONVERTER_TESTCFG_SHIFTEN_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.SHIFTEN */
#define IFX_CONVERTER_TESTCFG_SHIFTEN_OFF (1u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.RAMPEN */
#define IFX_CONVERTER_TESTCFG_RAMPEN_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.RAMPEN */
#define IFX_CONVERTER_TESTCFG_RAMPEN_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.RAMPEN */
#define IFX_CONVERTER_TESTCFG_RAMPEN_OFF (2u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.CTRLEN */
#define IFX_CONVERTER_TESTCFG_CTRLEN_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.CTRLEN */
#define IFX_CONVERTER_TESTCFG_CTRLEN_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.CTRLEN */
#define IFX_CONVERTER_TESTCFG_CTRLEN_OFF (3u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.PPEN */
#define IFX_CONVERTER_TESTCFG_PPEN_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.PPEN */
#define IFX_CONVERTER_TESTCFG_PPEN_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.PPEN */
#define IFX_CONVERTER_TESTCFG_PPEN_OFF (4u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.PPDCAP */
#define IFX_CONVERTER_TESTCFG_PPDCAP_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.PPDCAP */
#define IFX_CONVERTER_TESTCFG_PPDCAP_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.PPDCAP */
#define IFX_CONVERTER_TESTCFG_PPDCAP_OFF (5u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.PPPROG */
#define IFX_CONVERTER_TESTCFG_PPPROG_LEN (4u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.PPPROG */
#define IFX_CONVERTER_TESTCFG_PPPROG_MSK (0xfu)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.PPPROG */
#define IFX_CONVERTER_TESTCFG_PPPROG_OFF (6u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.PPSCC */
#define IFX_CONVERTER_TESTCFG_PPSCC_LEN (2u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.PPSCC */
#define IFX_CONVERTER_TESTCFG_PPSCC_MSK (0x3u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.PPSCC */
#define IFX_CONVERTER_TESTCFG_PPSCC_OFF (10u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.FROMTB */
#define IFX_CONVERTER_TESTCFG_FROMTB_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.FROMTB */
#define IFX_CONVERTER_TESTCFG_FROMTB_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.FROMTB */
#define IFX_CONVERTER_TESTCFG_FROMTB_OFF (12u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.ONEAHALF */
#define IFX_CONVERTER_TESTCFG_ONEAHALF_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.ONEAHALF */
#define IFX_CONVERTER_TESTCFG_ONEAHALF_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.ONEAHALF */
#define IFX_CONVERTER_TESTCFG_ONEAHALF_OFF (13u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.BLOCKSEL */
#define IFX_CONVERTER_TESTCFG_BLOCKSEL_LEN (6u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.BLOCKSEL */
#define IFX_CONVERTER_TESTCFG_BLOCKSEL_MSK (0x3fu)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.BLOCKSEL */
#define IFX_CONVERTER_TESTCFG_BLOCKSEL_OFF (14u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.PPTEST */
#define IFX_CONVERTER_TESTCFG_PPTEST_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.PPTEST */
#define IFX_CONVERTER_TESTCFG_PPTEST_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.PPTEST */
#define IFX_CONVERTER_TESTCFG_PPTEST_OFF (20u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.PPFDN */
#define IFX_CONVERTER_TESTCFG_PPFDN_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.PPFDN */
#define IFX_CONVERTER_TESTCFG_PPFDN_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.PPFDN */
#define IFX_CONVERTER_TESTCFG_PPFDN_OFF (21u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.PPFUP */
#define IFX_CONVERTER_TESTCFG_PPFUP_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.PPFUP */
#define IFX_CONVERTER_TESTCFG_PPFUP_MSK (0x1u)

