Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxConverter_bf.h
/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.PPFUP */
#define IFX_CONVERTER_TESTCFG_PPFUP_OFF (22u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.CLKASYN */
#define IFX_CONVERTER_TESTCFG_CLKASYN_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.CLKASYN */
#define IFX_CONVERTER_TESTCFG_CLKASYN_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.CLKASYN */
#define IFX_CONVERTER_TESTCFG_CLKASYN_OFF (24u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.CLKDEL */
#define IFX_CONVERTER_TESTCFG_CLKDEL_LEN (3u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.CLKDEL */
#define IFX_CONVERTER_TESTCFG_CLKDEL_MSK (0x7u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.CLKDEL */
#define IFX_CONVERTER_TESTCFG_CLKDEL_OFF (25u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.CLKDIV */
#define IFX_CONVERTER_TESTCFG_CLKDIV_LEN (3u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.CLKDIV */
#define IFX_CONVERTER_TESTCFG_CLKDIV_MSK (0x7u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.CLKDIV */
#define IFX_CONVERTER_TESTCFG_CLKDIV_OFF (28u)

/** \brief Length for Ifx_CONVERTER_TESTCFG_Bits.CLKEN */
#define IFX_CONVERTER_TESTCFG_CLKEN_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_TESTCFG_Bits.CLKEN */
#define IFX_CONVERTER_TESTCFG_CLKEN_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_TESTCFG_Bits.CLKEN */
#define IFX_CONVERTER_TESTCFG_CLKEN_OFF (31u)

/** \brief Length for Ifx_CONVERTER_FLAGS_Bits.SHOR */
#define IFX_CONVERTER_FLAGS_SHOR_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_FLAGS_Bits.SHOR */
#define IFX_CONVERTER_FLAGS_SHOR_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_FLAGS_Bits.SHOR */
#define IFX_CONVERTER_FLAGS_SHOR_OFF (0u)

/** \brief Length for Ifx_CONVERTER_FLAGS_Bits.SHUR */
#define IFX_CONVERTER_FLAGS_SHUR_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_FLAGS_Bits.SHUR */
#define IFX_CONVERTER_FLAGS_SHUR_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_FLAGS_Bits.SHUR */
#define IFX_CONVERTER_FLAGS_SHUR_OFF (1u)

/** \brief Length for Ifx_CONVERTER_MISC_Bits.WAIT */
#define IFX_CONVERTER_MISC_WAIT_LEN (16u)

/** \brief Mask for Ifx_CONVERTER_MISC_Bits.WAIT */
#define IFX_CONVERTER_MISC_WAIT_MSK (0xffffu)

/** \brief Offset for Ifx_CONVERTER_MISC_Bits.WAIT */
#define IFX_CONVERTER_MISC_WAIT_OFF (0u)

/** \brief Length for Ifx_CONVERTER_MISC_Bits.STAY */
#define IFX_CONVERTER_MISC_STAY_LEN (1u)

/** \brief Mask for Ifx_CONVERTER_MISC_Bits.STAY */
#define IFX_CONVERTER_MISC_STAY_MSK (0x1u)

/** \brief Offset for Ifx_CONVERTER_MISC_Bits.STAY */
#define IFX_CONVERTER_MISC_STAY_OFF (16u)

/** \brief Length for Ifx_CONVERTER_MISC_Bits.SWGK */
#define IFX_CONVERTER_MISC_SWGK_LEN (5u)

/** \brief Mask for Ifx_CONVERTER_MISC_Bits.SWGK */
#define IFX_CONVERTER_MISC_SWGK_MSK (0x1fu)

/** \brief Offset for Ifx_CONVERTER_MISC_Bits.SWGK */
#define IFX_CONVERTER_MISC_SWGK_OFF (17u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCONVERTER_BF_H */
